In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('../harga_rumah.csv')

In [3]:
df

        harga  luas  kasur  km
0    13300000  7420      4   2
1    12250000  8960      4   4
2    12250000  9960      3   2
3    12215000  7500      4   2
4    11410000  7420      4   1
..        ...   ...    ...  ..
540   1820000  3000      2   1
541   1767150  2400      3   1
542   1750000  3620      2   1
543   1750000  2910      3   1
544   1750000  3850      3   1

[545 rows x 4 columns]

In [12]:
#rumah dengan harga termahal#
df['harga'].max()

13300000

In [13]:
#rumah dengan harga terendah#
df['harga'].min()

1750000

In [14]:
#rata-rata harga rumah#
df['harga'].mean()

4766729.247706422

In [15]:
#rumah dengan ukuran terluas#
df['luas'].max()

16200

In [16]:
#rumah dengan ukuran terkecil#
df['luas'].min()

1650

In [17]:
#rata-rata luas rumah yang ditawarkan#
df['luas'].mean()

5150.54128440367

In [11]:
#rumah yang paling sering dibeli berdasarkan harga#
df['harga'].value_counts()

3500000     17
4200000     17
4900000     12
3150000      9
5600000      9
            ..
6580000      1
4319000      1
4375000      1
4382000      1
13300000     1
Name: harga, Length: 219, dtype: int64